`timescale 1ns/1ps

module tb_sine;

    // testbench里主动赋值的信号，用reg
    reg clk;
    reg rst_n;
    reg [31:0] freq_ctrl;

    // 被测模块输出，用wire接收
    wire [7:0] sine_out;

    // =========================================================
    // 实例化正弦波模块
    // =========================================================
    sine_gen uut (
        .clk(clk),
        .rst_n(rst_n),
        .freq_ctrl(freq_ctrl),
        .sine_out(sine_out)
    );

    // =========================================================
    // 100MHz时钟：10ns周期
    // =========================================================
    always #5 clk = ~clk;

    // =========================================================
    // 仿真激励
    // =========================================================
    initial begin
        clk = 0;
        rst_n = 0;
        freq_ctrl = 1;   // 先设小一点，方便看变化

        #20;
        rst_n = 1;

        #5000;
        $stop;
    end

endmodule