`timescale 1ns/1ps

module tb_top;

    //====================================================
    // 1. 输入信号
    //====================================================
    reg clk;
    reg rst_n;
    reg [1:0] mode;
    reg [2:0] freq_sel;

    //====================================================
    // 2. 输出信号
    //====================================================
    wire [7:0] wave_out;
    wire pwm_out;

    //====================================================
    // 3. 行为级 RC 滤波观察量
    // 这里只是为了在仿真中看"平滑趋势"
    // 不代表真实模拟电路参数
    //====================================================
    real v_rc;

    //====================================================
    // 4. 实例化顶层模块
    //====================================================
    top uut (
        .clk(clk),
        .rst_n(rst_n),
        .mode(mode),
        .freq_sel(freq_sel),
        .wave_out(wave_out),
        .pwm_out(pwm_out)
    );

    //====================================================
    // 5. 100MHz 时钟：周期 10ns
    //====================================================
    initial clk = 1'b0;
    always #5 clk = ~clk;

    //====================================================
    // 6. RC 滤波行为级近似
    // pwm_out=1 时，v_rc 向 1.0 靠近
    // pwm_out=0 时，v_rc 向 0.0 靠近
    //====================================================
    initial v_rc = 0.0;

    always @(posedge clk) begin
        if (pwm_out)
            v_rc = v_rc + 0.02 * (1.0 - v_rc);
        else
            v_rc = v_rc + 0.02 * (0.0 - v_rc);
    end

    //====================================================
    // 7. 仿真激励
    // 当前目标：只验证 DDS 正弦波升级效果
    //====================================================
    initial begin
        // 初始状态
        rst_n    = 1'b0;
        mode     = 2'b10;   // 只看正弦波
        freq_sel = 3'd2;    // 选中间频率档，便于观察

        // 保持复位
        #20;
        rst_n = 1'b1;

        // 保持一段时间，观察 sine_out / pwm_out / v_rc
        #1000000;

        $stop;
    end

endmodule